salara1960/stm32f401_project/Core/Src/main.c
}
//-------------------------------------------------------------------------------------------
evt_t getMsg()
{
evt_t ret = msg_empty;

	HAL_NVIC_DisableIRQ(EXTI1_IRQn);
	HAL_NVIC_DisableIRQ(TIM3_IRQn);
	HAL_NVIC_DisableIRQ(USART1_IRQn);
	HAL_NVIC_DisableIRQ(USART6_IRQn);
//	HAL_NVIC_DisableIRQ(SPI1_IRQn);

	if (cnt_evt) {
		ret = evt_fifo[rd_evt_adr];
		if (cnt_evt) cnt_evt--;
		if (rd_evt_adr < (MAX_FIFO_SIZE - 1) ) {
			rd_evt_adr++;
		} else {
			rd_evt_adr = 0;
		}
	}

//	HAL_NVIC_EnableIRQ(SPI1_IRQn);
	HAL_NVIC_EnableIRQ(USART6_IRQn);
	HAL_NVIC_EnableIRQ(USART1_IRQn);
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
	HAL_NVIC_EnableIRQ(EXTI1_IRQn);

	return ret;
}
//-------------------------------------------------------------------------------------------

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_I2C2_Init();
  MX_RTC_Init();
  MX_TIM3_Init();
  MX_USART6_UART_Init();
  /* USER CODE BEGIN 2 */

  	HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    HAL_Delay(250);
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);


    //"start" rx_interrupt
    HAL_UART_Receive_IT(&huart1, (uint8_t *)&uRxByte, 1);
    HAL_UART_Receive_IT(&huart6, (uint8_t *)&dfp_uRxByte, 1);

    // start timer3 in interrupt mode
    HAL_TIM_Base_Start_IT(&htim3);


    oled_withDMA = 1;

    i2c_ssd1306_init();//screen INIT
    i2c_ssd1306_pattern();//set any params for screen
    //i2c_ssd1306_invert();
    i2c_ssd1306_clear();//clear screen

    set_Date((time_t)(++epoch));

#ifdef SET_KBD
    kbdPresent = KBD_getAddr(&kbdAddr);
    if (kbdPresent) {
    	kbdInitOk = kbdInit();
    	if (kbdInitOk) kbdEnable = true;
    }
#endif

    Report(NULL, true, "Version '%s' KBD: Present=%d Init=%d Addr=0x%02X, ERROR: 0x%X\n", version, kbdPresent, kbdInitOk, kbdAddr, devError);

#ifdef SET_W25FLASH
    //W25_UNSELECT();

    int8_t cn = 4;
    while (--cn) {
    	HAL_Delay(500);
    	if (W25qxx_Init()) break;
    }
#endif

#ifdef SET_DFPLAYER
    DFP_reset();
    HAL_Delay(100);
    DFP_set_eq(eqClass);
#endif

    evt_t evt = msg_none;
    uint32_t last_sec = (uint32_t)epoch;




  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

    while (!restart_flag) {

    	evt = getMsg();
    	switch ((int)evt) {
    		case msg_kbd:
#if defined(SET_KBD) && defined(SET_OLED_I2C)
    			//kbdCnt++;
    			//kbdCode = kbd_get_touch();
    			sprintf(buf, "KBD: <%c>", (char)kbdCode);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 8);
#endif
#ifdef SET_DFPLAYER
    			evt_t new_evt = msg_none;
    			switch (kbdCode) {
    				case '*':
    					new_evt = msg_play;
    				break;
    				case '0':
    					new_evt = msg_rplay;
    				break;
    				case '#':
    					new_evt = msg_stop;
    				break;
    				case '9':
    					new_evt = msg_back;
    				break;
    				case '8':
    					new_evt = msg_eqSet;
    				break;
    				case '7':
    					new_evt = msg_fwd;
    				break;
    				case '6':
    					new_evt = msg_volDown;
    				break;
    				case '5':
    					new_evt = msg_volGet;
    				break;
    				case '4':
    					new_evt = msg_volUp;
    				break;
    				case '2':
    					new_evt = msg_eqGet;
    				break;
    			}
    			if (new_evt != msg_none) putMsg(new_evt);
#endif
    		break;
#ifdef SET_DFPLAYER
    		case msg_play:
    			DFP_play();
    			//
    			putMsg(msg_track);
    		break;
    		case msg_rplay:
    			DFP_play_root(1, true);
    			//
    			putMsg(msg_track);
    		break;
    		case msg_stop:
    			DFP_stop();
    			//
    			strcpy(buf, " Stop ");
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 7);
    		break;
    		case msg_fwd:
    			DFP_play_next();
    			//
    			putMsg(msg_track);
    		break;
    		case msg_eqSet:
    			eqClass++;
    			if (eqClass > EQ_Bass) eqClass = EQ_Normal;
    			DFP_set_eq(eqClass);
    			//
    			sprintf(buf, " eq : %s ", eqName[eqClass]);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 7);
    		break;
    		case msg_eqGet:
    		    DFP_get_eq();
    		break;
    		case msg_back:
    			DFP_play_previous();
    			//
    			putMsg(msg_track);
    		break;
    		case msg_volUp:
    			DFP_volumeUP();
    			if (dfp_volume < 30) dfp_volume++;
    			//
    			sprintf(buf, " Volume : %d ", dfp_volume);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 7);
    		break;
    		case msg_volDown:
    			DFP_volumeDOWN();
    			if (dfp_volume > 0) dfp_volume--;
    			//
    			sprintf(buf, " Volume : %d ", dfp_volume);
    			mkLineCenter(buf, FONT_WIDTH);
    			i2c_ssd1306_text_xy(buf, 1, 7);
    		break;
    		case msg_volGet:
    			DFP_get_volume();
    		break;
    		case msg_track:
    			DFP_get_playing();
    		break;
    		case msg_dfpRX:
    		{
#ifdef DFP_DUBUG
    			stx[0] = '\0';
    			for (int i = 0; i < dfp_ACK_len; i++) sprintf(stx+strlen(stx), " %02X", *(dfp_ACK + i));
    			Report("msg_dfpRX", true, "%s\n", stx);
#endif
    			cmd_t *ack = (cmd_t *)&dfp_ACK[0];
    			bool ys = false;
    			switch (dfpCmd) {
    				case DFPLAYER_QUERY_VOLUME:
    					dfp_volume = ack->par2;
    					sprintf(buf, " Volume : %d ", dfp_volume);
    					ys = true;
    				break;
    				case DFPLAYER_QUERY_EQ:
    					eqClass = ack->par2;
    					sprintf(buf, " Eq : %s ", eqName[eqClass]);
    					ys = true;
    				break;
    				case DFPLAYER_QUERY_SD_TRACK:
    					sprintf(buf, " Track : %d ", ack->par2);
    					ys = true;
    				break;
    			}
    			if (ys) {
    				mkLineCenter(buf, FONT_WIDTH);
    				i2c_ssd1306_text_xy(buf, 1, 7);
    			}
    		}
    		break;
#endif
    		case msg_sec:
    		{
    			uint32_t cur_sec = get_tmr(0);
    			sec_to_str_time(cur_sec, buf);
    			sprintf(buf+strlen(buf), "\nFIFO:%u %u\nERROR: 0x%02X", cnt_evt, max_evt, devError);
#ifdef SET_OLED_I2C
    			i2c_ssd1306_text_xy(buf, 2, 1);
#endif
    			if (cur_sec >= (uint32_t)epoch) {
    				if (cur_sec == last_sec)
    					set_Date((time_t)(cur_sec));
    				else
    					last_sec = cur_sec;
    			}
    		}
    		break;
    	}

    /* USER CODE END WHILE */

